## Plan Result (prod-prod)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hearings.azurerm_dns_cname_record.this[&#34;_756F7E453FD13D587ECD32E429FB90D7.test2&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_E77267C82D6FC200DEA9407A4E3D74DA.stream.test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_EAADD6BDA2F3817575B519420F718950.stream.test2&#34;]
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;internal&#34;]
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings.azurerm_dns_cname_record.this["_756F7E453FD13D587ECD32E429FB90D7.test2"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_756f7e453fd13d587ecd32e429fb90d7.test2"
      + record              = "04752046EB3F1BC6DCDEEC25B8C13959.B352DD36565E76D136C1E8520042BD91.dc045c9118da579b777c.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_E77267C82D6FC200DEA9407A4E3D74DA.stream.test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_e77267c82d6fc200dea9407a4e3d74da.stream.test"
      + record              = "28F6B9222EA7C171CDDDC04B6B530812.1058103CFB3BB6771D070CBDC24E30F9.5a280ef366a247dc652f.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["_EAADD6BDA2F3817575B519420F718950.stream.test2"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_eaadd6bda2f3817575b519420f718950.stream.test2"
      + record              = "32CD820F2438207651BB626E8D5B9478.0B743128257B66D745D7D429F3202A36.580055d13cb169df9abf.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_ns_record.this["internal"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "internal"
      + records             = [
          + "ns1-02.azure-dns.com",
          + "ns2-02.azure-dns.net",
          + "ns3-02.azure-dns.org",
          + "ns4-02.azure-dns.info",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1139,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->